; domain
(define (domain overcooked)
  (:requirements :adl :typing :equality)
  (:types
    location - object ; Locations of objects and the agent
    food receptacle tool - item ; Objects that can be held and moved
    appliance - object ; Appliances that can be used to combine or cook food
    ftype rtype ttype atype - type ; Food, receptacle, tool and appliance types
    prepare-method combine-method cook-method - method ; Methods for cooking, etc
  )
  (:predicates
    ;; Static predicates

    ; Whether food ingredient ?f is of type ?ty
    (food-type ?ty - ftype ?f - food)
    ; Whether receptacle ?r is of type ?ty
    (receptacle-type ?ty - rtype ?r - receptacle)
    ; Whether tool ?t is of type ?ty
    (tool-type ?t - ttype ?t - tool)
    ; Whether appliance ?a has type ?ty
    (appliance-type ?ty - atype ?a - appliance)

    ; Whether ?r-typed receptacle and ?t-typed tool can prepare via method ?m
    (has-prepare-method ?m - prepare-method ?r - rtype ?t - ttype)
    ; Whether ?r-typed receptacle and ?a-typed appliance can combine via method ?m
    (has-combine-method ?m - combine-method ?r - rtype ?a - atype)
    ; Whether ?r-typed receptacle and ?a-typed appliance can cook via method ?m
    (has-cook-method ?m - cook-method ?r - rtype ?a - atype)

    ;; Dynamic predicates

    ; Whether agent is at location ?l
    (agent-at-loc ?l - location)
    ; Whether object is at location ?l
    (object-at-loc ?o - object ?l - location)

    ; Whether the agent is not holding anything
    (handempty)
    ; Whether the agent is holding item ?i
    (holding ?i - item)

    ; Whether food item ?i is in or on receptacle ?r
    (in-receptacle ?i - food ?r - receptacle)
    ; Whether item ?i is in or on appliance ?a
    (in-appliance ?i - item ?a - appliance)
    ; Whether appliance ?a is occupied
    (occupied ?a - appliance)

    ; Whether food item ?f is prepared
    (is-prepared ?f - food)
    ; Whether food item ?f was prepared using method ?m
    (prepared ?m - prepare-method ?f - food)

    ; Whether food item ?f is combined
    (is-combined ?f - food)
    ; Whether food item ?f was combined using method ?m
    (combined ?m - combine-method ?f - food)
    ; Whether food items ?f1 and ?f2 were combined together using method ?m
    (combined-with ?m - combine-method ?f1 ?f2 - food)

    ; Whether food item ?f is cooked
    (is-cooked ?f - food)
    ; Whether food item ?f was cooked using method ?m
    (cooked ?m - cook-method ?f - food)
    ; Whether food items ?f1 and ?f2 were cooked together using method ?m
    (cooked-with ?m - cook-method ?f1 ?f2 - food)
  )

  ; Move from location ?l1 to location ?l2
  (:action move
   :parameters (?l1 ?l2 - location)
   :precondition (agent-at-loc ?l1)
   :effect (and (agent-at-loc ?l2) (not (agent-at-loc ?l1)))
  )

  ; Pick up item ?i at location ?l
  (:action pick-up
   :parameters (?i - item ?l - location)
   :precondition (and (handempty) (agent-at-loc ?l) (object-at-loc ?i ?l))
   :effect (and (holding ?i) (not (object-at-loc ?i ?l)) (not (handempty))
                (forall (?a - appliance)
                        (when (object-at-loc ?a ?l)
                              (and (not (occupied ?a))
                                   (not (in-appliance ?i ?a))))))
  )

  ; Put down item ?i at location ?l
  (:action put-down
   :parameters (?i - item ?l - location)
   :precondition (and (agent-at-loc ?l) (holding ?i)
                      (forall (?a - appliance)
                              (imply (object-at-loc ?a ?l) (not (occupied ?a)))))
   :effect (and (handempty) (object-at-loc ?i ?l) (not (holding ?i))
                (forall (?a - appliance)
                        (when (object-at-loc ?a ?l)
                              (and (occupied ?a) (in-appliance ?i ?a)))))
  )

  ; Take out food item ?i in receptacle ?r at location ?l
  (:action take-out
   :parameters (?i - food ?r - receptacle ?l - location)
   :precondition (and (handempty) (in-receptacle ?i ?r)
                      (agent-at-loc ?l) (object-at-loc ?r ?l)
                      (not (is-combined ?i)) (not (is-cooked ?i)))
   :effect (and (holding ?i) (not (in-receptacle ?i ?r)) (not (handempty)))
  )

  ; Place food item ?i in receptacle ?r at location ?l
  (:action place-in
   :parameters (?i - food ?r - receptacle ?l - location)
   :precondition (and (holding ?i) (agent-at-loc ?l) (object-at-loc ?r ?l))
   :effect (and (handempty) (in-receptacle ?i ?r) (not (holding ?i)))
  )

  ; Transfer all items in held receptacle ?src to receptacle ?dst at location ?l
  (:action transfer
   :parameters (?src ?dst - receptacle ?l - location)
   :precondition (and (holding ?src) (agent-at-loc ?l) (object-at-loc ?dst ?l)
                      (not (= ?src ?dst)))
   :effect (forall (?i - item)
                   (when (in-receptacle ?i ?src)
                         (and (in-receptacle ?i ?dst)
                              (not (in-receptacle ?i ?src)))))
  )

  ; Prepare a piece of food ?f in receptacle ?r using tool ?t via method ?m
  (:action prepare
   :parameters (?m - prepare-method ?r - receptacle ?t - tool
                ?f - food ?l - location)
   :precondition (and (holding ?t) (in-receptacle ?f ?r)
                      (agent-at-loc ?l) (object-at-loc ?r ?l)
                      (not (is-prepared ?f)) (not (is-combined ?f))
                      (not (is-cooked ?f))
                      (exists (?rt - rtype ?tt - ttype)
                              (and (receptacle-type ?rt ?r)
                                   (tool-type ?tt ?t)
                                   (has-prepare-method ?m ?rt ?tt))))
   :effect (and (is-prepared ?f) (prepared ?m ?f))
  )

  ; Combine ingredients in receptacle ?r using appliance ?a via method ?m
  (:action combine
   :parameters (?m - combine-method ?r - receptacle ?a - appliance ?l - location)
   :precondition (and (in-appliance ?r ?a)
                      (agent-at-loc ?l) (object-at-loc ?a ?l)
                      (exists (?rt - rtype ?at - atype)
                              (and (receptacle-type ?rt ?r)
                                   (appliance-type ?at ?a)
                                   (has-combine-method ?m ?rt ?at)))
                      (forall (?f - food)
                              (imply (in-receptacle ?f ?r)
                                     (and (not (is-combined ?f))
                                           (not (is-cooked ?f))))))
   :effect (forall (?f - food)
                    (when (in-receptacle ?f ?r)
                          (and (is-combined ?f) (combined ?m ?f)
                          )))
                          ;     (forall (?f2 - food)
                          ;            (when (and (in-receptacle ?f2 ?r)
                          ;                       (not (= ?f ?f2)))
                          ;                  (combined-with ?m ?f ?f2))))))
  )

  ; Cook ingredients in receptacle ?r using appliance ?a via method ?m
  (:action cook
   :parameters (?m - cook-method ?r - receptacle ?a - appliance ?l - location)
   :precondition (and (in-appliance ?r ?a)
                      (agent-at-loc ?l) (object-at-loc ?a ?l)
                      (exists (?rt - rtype ?at - atype)
                              (and (receptacle-type ?rt ?r)
                                   (appliance-type ?at ?a)
                                   (has-cook-method ?m ?rt ?at)))
                      (forall (?f - food)
                              (imply (in-receptacle ?f ?r)
                                     (not (is-cooked ?f)))))
   :effect (forall (?f - food)
                    (when (in-receptacle ?f ?r)
                          (and (is-cooked ?f) (cooked ?m ?f)
                          )))
                          ;     (forall (?f2 - food)
                          ;            (when (and (in-receptacle ?f2 ?r)
                          ;                        (not (= ?f ?f2)))
                          ;                  (cooked-with ?m ?f ?f2))))))
  )

)

; problem
; Salad bar with tomato and lettuce salad as goal
(define (problem overcooked-problem-1-2)
	(:domain overcooked)
	(:objects
		tomato lettuce cucumber - ftype ; Food types
		chopping-board plate - rtype ; Receptacle types
		knife - ttype ; Tool types
		slice - prepare-method ; Preparation methods
		tomato1 lettuce1 cucumber1 - food ; Food objects
		board1 plate1 - receptacle ; Receptacle objects
		knife1 - tool ; Tool objects
		start-loc food-loc chop-loc plate-loc - location ; Locations
	)
	(:init
		; Type declarations
		(food-type tomato tomato1)
		(food-type lettuce lettuce1)
		(food-type cucumber cucumber1)
		(receptacle-type chopping-board board1)
		(receptacle-type plate plate1)
		(tool-type knife knife1)
		; Method declarations
		(has-prepare-method slice chopping-board knife)
		; Initial agent state
		(handempty)
		(agent-at-loc start-loc)
		; Initial food locations
		(object-at-loc tomato1 food-loc)
		(object-at-loc lettuce1 food-loc)
		(object-at-loc cucumber1 food-loc)
		; Initial receptacle and tool locations
		(object-at-loc board1 chop-loc)
		(object-at-loc knife1 chop-loc)
		(object-at-loc plate1 plate-loc)
	)
	(:goal (and (prepared slice lettuce1)
	            (prepared slice tomato1)
	            (in-receptacle tomato1 plate1)
	            (in-receptacle lettuce1 plate1))
	)
)

; plan
1. (move start-loc food-loc)
   deleted: (agent-at-loc start-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 4
2. (pick-up tomato1 food-loc)
   deleted: (object-at-loc tomato1 food-loc) (handempty)
   added: (holding tomato1)
   goals met: 0 of 4
3. (move food-loc chop-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc chop-loc)
   goals met: 0 of 4
4. (place-in tomato1 board1 chop-loc)
   deleted: (holding tomato1)
   added: (handempty) (in-receptacle tomato1 board1)
   goals met: 0 of 4
5. (move chop-loc food-loc)
   deleted: (agent-at-loc chop-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 4
6. (pick-up lettuce1 food-loc)
   deleted: (object-at-loc lettuce1 food-loc) (handempty)
   added: (holding lettuce1)
   goals met: 0 of 4
7. (move food-loc chop-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc chop-loc)
   goals met: 0 of 4
8. (place-in lettuce1 board1 chop-loc)
   deleted: (holding lettuce1)
   added: (handempty) (in-receptacle lettuce1 board1)
   goals met: 0 of 4
9. (pick-up knife1 chop-loc)
   deleted: (object-at-loc knife1 chop-loc) (handempty)
   added: (holding knife1)
   goals met: 0 of 4
10. (prepare slice board1 knife1 lettuce1 chop-loc)
   added: (is-prepared lettuce1) (prepared slice lettuce1)
   goals met: 1 of 4
11. (prepare slice board1 knife1 tomato1 chop-loc)
   added: (is-prepared tomato1) (prepared slice tomato1)
   goals met: 2 of 4
12. (put-down knife1 chop-loc)
   deleted: (holding knife1)
   added: (handempty) (object-at-loc knife1 chop-loc)
   goals met: 2 of 4
13. (pick-up board1 chop-loc)
   deleted: (object-at-loc board1 chop-loc) (handempty)
   added: (holding board1)
   goals met: 2 of 4
14. (move chop-loc plate-loc)
   deleted: (agent-at-loc chop-loc)
   added: (agent-at-loc plate-loc)
   goals met: 2 of 4
15. (transfer board1 plate1 plate-loc)
   deleted: (in-receptacle tomato1 board1) (in-receptacle lettuce1 board1)
   added: (in-receptacle tomato1 plate1) (in-receptacle lettuce1 plate1)
   goals met: 4 of 4
